Hi @skatsaounis, thanks for the PR to fix this issue! I built the provider locally and confirmed the fix works by importing the existing NICs into the TF state and updating the interface name as well. But then, it looks like setting or updating the `vlan` field of the imported physical interface is not possible anymore. After a successful apply, the state still maintains the imported value for the `vlan` field, making subsequent `terraform apply` operations suggest an recurring in-place-update operation that is never applied.

In the below example, I set the `vlan` for the first interface while, left it empty for the second interface.
```hcl
Terraform will perform the following actions:

  # maas_network_interface_physical.configure_nic["node01ob48-enp0s25"] will be created
  + resource "maas_network_interface_physical" "configure_nic" {
      + id          = (known after apply)
      + mac_address = "b8:ae:ed:73:38:40"
      + machine     = "node01ob48"
      + mtu         = 1500
      + name        = "enp0s25"
      + tags        = (known after apply)
      + vlan        = 0
    }

  # maas_network_interface_physical.configure_nic["node01ob48-usb0"] will be created
  + resource "maas_network_interface_physical" "configure_nic" {
      + id          = (known after apply)
      + mac_address = "8c:ae:4c:df:50:7c"
      + machine     = "node01ob48"
      + mtu         = 1500
      + name        = "usb0"
      + tags        = (known after apply)
      + vlan        = (known after apply)
    }
```

When I run `terraform apply` again after a successful apply, I see the following output:
```hcl
maas_network_interface_physical.configure_nic["node01ob48-usb0"]: Refreshing state... [id=249]
maas_network_interface_physical.configure_nic["node01ob48-enp0s25"]: Refreshing state... [id=241]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # maas_network_interface_physical.configure_nic["node01ob48-enp0s25"] will be updated in-place
  ~ resource "maas_network_interface_physical" "configure_nic" {
        id          = "241"
        name        = "enp0s25"
        tags        = []
      ~ vlan        = 5 -> 0
        # (3 unchanged attributes hidden)
    }
```
The above plan seems to never take effect on the interface, however.
Is there any way to update the `vlan` field of the imported interface?